{
  "backend/main.mo": "Motoko actor that composes blob storage functionality by including the MixinStorage mixin, serving as the main backend entry point.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (CSV upload/stats, missing value handler, data filtering, visualization hub) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence descriptions of every frontend source file, serving as a reference summary for the project's component and hook structure.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system (colors, radius, chart palette, sidebar tokens).",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting metadata for the Advanced EDA Dashboard and mounting the React root via main.tsx.",
  "frontend/src/App.tsx": "Root React component that wraps the app in ThemeProvider and DataProvider, composes the layout with Header, Sidebar, MainContent, Chatbot, footer, and Toaster notifications.",
  "frontend/src/components/charts/BarChartComp.tsx": "Renders a Recharts bar chart for up to 50 rows, mapping a selected x and y column from DataRow data.",
  "frontend/src/components/charts/BoxplotChart.tsx": "Computes and renders an SVG boxplot (Q1, median, Q3, whiskers, outliers) for a single numeric column.",
  "frontend/src/components/charts/HeatmapChart.tsx": "Displays a Pearson correlation heatmap grid for up to 12 numeric columns, with color-coded cells and scrollable layout.",
  "frontend/src/components/charts/HistogramChart.tsx": "Renders a Recharts bar chart as a histogram with auto-computed bins for a single numeric column.",
  "frontend/src/components/charts/LineChartComp.tsx": "Renders a Recharts line chart for up to 300 data points using selected x and y columns.",
  "frontend/src/components/charts/PieChartComp.tsx": "Renders a Recharts pie chart by binning a numeric column's values into up to 8 labeled segments.",
  "frontend/src/components/charts/Scatter3D.tsx": "Renders an interactive 3D scatter plot using React Three Fiber with up to 1000 normalized data points and orbit controls.",
  "frontend/src/components/charts/ScatterChartComp.tsx": "Renders a Recharts scatter chart for up to 500 data points using two selected numeric columns.",
  "frontend/src/components/charts/TreemapChart.tsx": "Renders a Recharts treemap by binning a positive numeric column into up to 8 buckets with custom colored cell content.",
  "frontend/src/components/charts/ViolinPlot.tsx": "Renders an SVG violin plot for a numeric column using kernel density estimation, with an overlaid IQR box, median line, and Q1/Median/Q3 summary stats below.",
  "frontend/src/components/Chatbot.tsx": "Floating chat panel component with a toggle button, scrollable message history, and an input field that sends user questions to the useChatbot hook and renders bold-markdown responses.",
  "frontend/src/components/DatasetPreview.tsx": "Card component that displays the first 5 rows of the uploaded CSV in a horizontally scrollable table, annotating each column with its type and highlighting null values.",
  "frontend/src/components/DescriptiveStats.tsx": "Card component that renders a scrollable table of descriptive statistics (count, mean, std, min, Q1, median, Q3, max) for all numeric columns using data from DataContext.",
  "frontend/src/components/FileUpload.tsx": "Drag-and-drop CSV file upload component that parses the file using a custom hook and stores the result in DataContext, showing loading/success/error states via toasts.",
  "frontend/src/components/FilteredDataTable.tsx": "Displays a paginated (max 50 rows) table of filtered dataset rows with column headers, showing the active filter column and range in the card title.",
  "frontend/src/components/Header.tsx": "Sticky top header with app logo/title, a mobile sidebar menu toggle button, and a light/dark theme toggle button.",
  "frontend/src/components/MainContent.tsx": "Root layout component that renders a hero banner when no data is loaded, then conditionally renders all analysis sections (upload, summary, missing values, preview, stats, table, charts) once data is available.",
  "frontend/src/components/MissingValueHandler.tsx": "Conditionally rendered card that lets users choose a missing-value strategy (drop rows, fill with mean, or fill with median) and apply it to the dataset via DataContext.",
  "frontend/src/components/Sidebar.tsx": "Collapsible sidebar with a numeric column selector and range slider for filtering data, plus static quick-tip text; hidden on mobile unless toggled open.",
  "frontend/src/components/SummaryCards.tsx": "Displays three stat cards showing total rows, total columns, and missing value count sourced from DataContext, with color-coded icons.",
  "frontend/src/components/VisualizationHub.tsx": "Chart selection hub that lets users pick from ten chart types and configure X/Y/Z column axes, then renders the corresponding chart component using filtered data.",
  "frontend/src/context/DataContext.tsx": "Provides a React context for managing CSV dataset state including raw/filtered data, column metadata, descriptive statistics, missing value handling, and range-based filtering.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous access, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useChatbot.ts": "Custom hook implementing a rule-based EDA chatbot that parses natural language questions via regex intent matching and answers them using dataset statistics from DataContext.",
  "frontend/src/hooks/useCSVParser.ts": "Custom hook that parses a CSV File object into typed DataRow arrays and ColumnMeta, handling quoted fields, numeric type detection, and missing values.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file that exports nothing, noting that no backend queries are needed since the app uses client-side CSV processing only.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and JetBrains Mono fonts, defines Tailwind CSS light and dark theme CSS variables with a green accent, and adds utility styles for scrollbars and touch-friendly sizing.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color tokens using oklch variables, typography/container-queries/animate plugins, and extended theme values for fonts, shadows, border radius, and accordion animations.",
  "project_state.json": "Project state manifest (version 3) describing the EDA Dashboard app's architecture, existing features, known issues, and image requirements for a React+TypeScript PWA converted from a Streamlit app."
}